kmui2/453-MSP432/main.c
/* DriverLib Includes */
#include "debug.h"
#include "driverlib.h"
#include "stepper.h"
#include "time_and_down.h"
#include "seven_segment.h"
#include "helpers.h"
#include "cmd.h"

/* Standard Includes */
#include <stdint.h>
#include <stdio.h>

#include <stdbool.h>
#include <string.h>

volatile int8_t player1_move = 0;
volatile int8_t player2_move = 0;
volatile bool player1_locked = false;
volatile bool player2_locked = false;
volatile bool player1_offense = true;
volatile bool ttt_game_completed = false;
volatile bool ttt_player1_won = false;

#define TIC_TAC_TOE -1
#define ROCK_PAPER_SCISSORS -2
#define SIMON_SAYS -3
#define TRIVIA -4

#define NUM_PLAY_COMBOS 16
typedef struct
{
    int8_t player1;
    int8_t player2;
    double probability;
    int8_t outcome1; // negative indicates a minigame
    int8_t outcome2;
} play_combo_t;

play_combo_t play_combos[] = {
    {1, 1, 1.00, ROCK_PAPER_SCISSORS, 5},
    {1, 2, 0.80, 5, 0},
    {1, 3, 0.75, 10, 0},
    {1, 4, 0.90, 5, 0},
    {2, 1, 0.80, 5, 0},
    {2, 2, 1.00, TIC_TAC_TOE, 5},
    {2, 3, 0.90, 5, 0},
    {2, 4, 0.80, 10, 5},
    {3, 1, 0.85, 5, 0},
    {3, 2, 0.75, 5, 0},
    {3, 3, 1.00, TRIVIA, 5},
    {3, 4, 0.80, 15, 5},
    {4, 1, 0.75, 10, 0},
    {4, 2, 0.80, 15, 5},
    {4, 3, 0.80, 15, 5},
    {4, 4, 1.00, SIMON_SAYS, 5},
};

// ROCK PAPER SCISSORS

#define ROCK 1
#define PAPER 2
#define SCISSORS 4
typedef struct
{
    int8_t player1;
    int8_t player2;
    bool player1_wins;
} rps_combo_t;

rps_combo_t rps_combos[] = {
    {ROCK, ROCK, false},
    {ROCK, PAPER, false},
    {ROCK, SCISSORS, true},
    {PAPER, ROCK, true},
    {PAPER, PAPER, false},
    {PAPER, SCISSORS, false},
    {SCISSORS, ROCK, false},
    {SCISSORS, PAPER, true},
    {SCISSORS, SCISSORS, false},
};

// TRIVIA

typedef struct
{
    char question[100];
    char choice1[50];
    char choice2[50];
    char choice3[50];
    char choice4[50];
    int8_t answer;
} trivia_question_t;

#define NUM_TRIVIA_QUESTIONS 10

uint8_t curr_trivia_question = 0;

trivia_question_t trivia_questions[] = {
    {"What is the name of the trophy won in a UW vs UMN football game?", "Heartland Trophy", "Freedom Trophy", "Paul Bunyan's Axe", "Little Brown Jug", 2},
    {"What is teh name of UW's football stadium?", "Lambeu Field", "Camp Randall", "Miller Park", "Kohl Center", 1},
    {"What is the name of UMN's football stadium?", "TCF Bank Stadium", "US Bank Stadium", "Metrodome", "Target Field", 0},
    {"Who is UW's current coach (in May of 2019)?", "Barry Alvarez", "Brett Bielama", "Bo Ryan", "Paul Chryst", 3},
    {"Who is UMN's current coach (in May of 2019)?", "Rick Pitino", "PJ Fleck", "Richard Pitino", "Jerry Kill", 1},
    {"How many meetings were there between UW and UWM as of the end of 2018?", "128", "172", "87", "101", 0},
    {"Who has more wins in the UW-UMN football series?", "Golden Gophers", "Badgers", "Tied", "Hawkeyes", 2},
    {"What is the name of the trophy in UW-UMN football game before the axe?", "Heartland Trophy", "River Jug", "Slab of Bacon", "Rodent of Trophy", 2},
    {"Who holds the longest win streak in the UW-UMN football series?", "Spartans", "Buckeyes", "Golden Gophers", "Badgers", 3},
    {"What is the only year since 1890 UW and UMN did not play each other in football?", "1942", "1906", "1963", "1929", 1},
};

// SIMON SAYS
#define BLUE 1
#define GREEN 2
#define ORANGE 3
#define RED 4

volatile int8_t curr_player_seq = 0;
volatile int8_t simon_says_happening = false;
volatile bool simon_says_player_won = false;
volatile int8_t simon_says_seq[10];


int main(void)
{
    volatile uint32_t ii;
    char message[500];
    int i;
    int8_t outcome_res;
    int8_t trivia_choice;
    bool scoredTouchdown = false;

    const eUSCI_UART_Config uartConfig_9600 =
        {
            EUSCI_A_UART_CLOCKSOURCE_SMCLK,               // SMCLK Clock Source
            78,                                           // BRDIV = 13
            2,                                            // UCxBRF = 0
            0,                                            // UCxBRS = 37
            EUSCI_A_UART_NO_PARITY,                       // No Parity
            EUSCI_A_UART_MSB_FIRST,                       // MSB First
            EUSCI_A_UART_ONE_STOP_BIT,                    // One stop bit
            EUSCI_A_UART_MODE,                            // UART mode
            EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION // Oversampling
        };
    
    const Timer_A_ContinuousModeConfig continuousModeConfig =
{
        TIMER_A_CLOCKSOURCE_ACLK,           // ACLK Clock Source
        TIMER_A_CLOCKSOURCE_DIVIDER_1,      // ACLK/1 = 32.768khz
        TIMER_A_TAIE_INTERRUPT_ENABLE,      // Enable Overflow ISR
        TIMER_A_DO_CLEAR                    // Clear Counter
}   ;

    /* Halting the Watchdog */
    WDT_A_holdTimer();

    /* Setting DCO to 12MHz */
    CS_setDCOCenteredFrequency(CS_DCO_FREQUENCY_12);

    /////////////////
    // Timers
    /////////////////
    Timer_A_configureContinuousMode(TIMER_A1_BASE, &continuousModeConfig);

    /////////////////
    // UART
    /////////////////

    // Receive interrupt from the Pi
    GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P1,
                                               GPIO_PIN1 | GPIO_PIN2 | GPIO_PIN3, GPIO_PRIMARY_MODULE_FUNCTION);
    UART_initModule(EUSCI_A0_BASE, &uartConfig_9600);
    UART_enableModule(EUSCI_A0_BASE);
    UART_enableInterrupt(EUSCI_A0_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT);
    Interrupt_enableInterrupt(INT_EUSCIA0);

    // Receive interrupt from controller 1
    GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P2,
                                               GPIO_PIN1 | GPIO_PIN2 | GPIO_PIN3, GPIO_PRIMARY_MODULE_FUNCTION);
    UART_initModule(EUSCI_A1_BASE, &uartConfig_9600);
    UART_enableModule(EUSCI_A1_BASE);
    UART_enableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT);
    Interrupt_enableInterrupt(INT_EUSCIA1);

    // Receive interrupt from controller 2
    GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P3,
                                               GPIO_PIN1 | GPIO_PIN2 | GPIO_PIN3, GPIO_PRIMARY_MODULE_FUNCTION);
    UART_initModule(EUSCI_A2_BASE, &uartConfig_9600);
    UART_enableModule(EUSCI_A2_BASE);
    UART_enableInterrupt(EUSCI_A2_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT);
    Interrupt_enableInterrupt(INT_EUSCIA2);

    /////////////////
    // Outputs
    /////////////////

    initStepper();
    setStepperSpeed(15);
    initSevenSegment();
    initTimeAndDown();

