kmui2/453-MSP432/main.c
    // GPIO_setAsOutputPin(GPIO_PORT_P1, GPIO_PIN0);
    // GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);

    // GPIO_setAsOutputPin(GPIO_PORT_P2, GPIO_PIN0);
    // GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0);

    // GPIO_setAsOutputPin(GPIO_PORT_P2, GPIO_PIN1);
    // GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN1);

    // GPIO_setAsOutputPin(GPIO_PORT_P2, GPIO_PIN2);
    // GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN2);

    /////////////////
    // Inputs
    /////////////////

    /* Configuring P1.1 as an input and enabling interrupts */
    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_clearInterruptFlag(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_enableInterrupt(GPIO_PORT_P1, GPIO_PIN1);
    Interrupt_enableInterrupt(INT_PORT1);

    /* Configuring P1.4 as an input and enabling interrupts */
    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P1, GPIO_PIN4);
    GPIO_clearInterruptFlag(GPIO_PORT_P1, GPIO_PIN4);
    GPIO_enableInterrupt(GPIO_PORT_P1, GPIO_PIN4);

    /* Enabling SRAM Bank Retention */
    SysCtl_enableSRAMBankRetention(SYSCTL_SRAM_BANK1);

    /* Enabling MASTER interrupts */
    Interrupt_enableMaster();
    sendCmd("WELCOME");
    movefootball(-120);
    moveFootballToYardage(25);

    // TODO: while game is on
    while (!game_over)
    {
        if (halftime) {
            // TODO: show halftime screen
						player1_offense = false;
            resetTimeAndDown(player1_offense);
            moveFootballToYardage(75);
            halftime = false;
            delayTimer(3);
        }
        scoredTouchdown = false;
        sendCmd("SELECT_PLAY");
        startTime();

        player1_locked = false;
        player2_locked = false;

        /* Going to LPM3 */
        while (!player1_locked || !player2_locked)
        {
            PCM_gotoLPM0();
        }

        if (getDown() == 4)
        {
            // Player 1 Punts
            if (player1_offense && player1_move == 1)
            {
                if (getYardage() > 70) {
                    moveFootballToYardage(100);
                } else {
                    moveFootballForwardBy(+30);
                }
                player1_offense = false;
                resetTimeAndDown(player1_offense);
                continue;
            }
            // Player 1 Field Goals
            else if (player1_offense && player1_move == 4)
            {
                if (getYardage() > 70)
                {
                    sendCmd("OUTCOME -h \"Field Goal is Good!\"");
                    incrementPlayer1ScoreBy(3);
                    // Move football to 75 yardline for kickoff
                    moveFootballToYardage(75);
                    delayTimer(3);
                }
                else if (getYardage() > 60 && getYardage() <= 70)
                {
                    if (r2() > 0.5)
                    {
                        sendCmd("OUTCOME -h \"Field Goal is Good!\"");
                        incrementPlayer2ScoreBy(3);
                        // Move football to 75 yardline for kickoff
                        moveFootballToYardage(75);
                        delayTimer(3);
                    }
                    else
                    {
                        sendCmd("OUTCOME -h \"Field Goal is No Good!\"");
                        delayTimer(3);
                    }
                }
                else
                {
                    sendCmd("OUTCOME -h \"Field Goal is No Good!\"");
                    delayTimer(3);
                }
                player1_offense = false;
                resetTimeAndDown(player1_offense); 
                continue;
            }
            // Player 2 Punts
            else if (!player1_offense && player2_move == 1)
            {
                if (getYardage() < 30) {
                    moveFootballToYardage(0);
                } else {
                    moveFootballForwardBy(-30);
                }
                player1_offense = true;
                resetTimeAndDown(player1_offense); 
                continue;
            }
            // Player 2 Field Goals
            else if (!player1_offense && player2_move == 4)
            {
                if (getYardage() < 30)
                {
                    sendCmd("OUTCOME -h \"Field Goal is Good!\"");
                    incrementPlayer2ScoreBy(3);
                    // Move football to 25 yardline for kickoff
                    moveFootballToYardage(25);
                    delayTimer(3);
                }
                else if (getYardage() < 40 && getYardage() >= 30)
                {
                    if (r2() > 0.5)
                    {
                        sendCmd("OUTCOME -h \"Field Goal is Good!\"");
                        incrementPlayer2ScoreBy(3);
                        // Move football to 25 yardline for kickoff
                        moveFootballToYardage(25);
                        delayTimer(3);
                    }
                    else
                    {
                        sendCmd("OUTCOME -h \"Field Goal is No Good!\"");
                        delayTimer(3);
                    }
                }
                else
                {
                    sendCmd("OUTCOME -h \"Field Goal is No Good!\"");
                    delayTimer(3);
                }
                player1_offense = true;
                resetTimeAndDown(player1_offense);                
                continue;
            }
        }

        // Normal plays
        for (i = 0; i < NUM_PLAY_COMBOS; i++)
        {
            if (play_combos[i].player1 == player1_move && play_combos[i].player2 == player2_move)
            {
                if (r2() < play_combos[i].probability)
                {
                    outcome_res = play_combos[i].outcome1;
                }
                else
                {
                    outcome_res = play_combos[i].outcome2;
                }
            }
        }

        if (outcome_res >= 0)
        {
            if (player1_offense)
            {
                scoredTouchdown = moveFootballForwardBy(outcome_res);
                decrementDistanceBy(outcome_res);
            }
            else
            {
                scoredTouchdown = moveFootballForwardBy(-outcome_res);
                decrementDistanceBy(outcome_res);
            }
        } 
        // Outcome is a minigame (defined by a negative number)
        else
        {
            switch (outcome_res)
            {
            case TIC_TAC_TOE:
                // 1. Change screen to TIC TAC TOE
                // 2. Wait for game to complete
                // 3. Move the ball by the result (if there is a tie, nothing hapens)
                pauseTime();
                sendCmd("TIC_TAC_TOE X O");
                ttt_game_completed = false;
                while (!ttt_game_completed)
                {
                    PCM_gotoLPM0();
                }

                // Let the results screen display for 3 seconds
                delayTimer(3);

                startTime();
                if (player1_offense && ttt_player1_won)
                {
                    scoredTouchdown = moveFootballForwardBy(10);
                    decrementDistanceBy(10);
                }
                else if (!player1_offense && !ttt_player1_won)
                {
                    scoredTouchdown = moveFootballForwardBy(-10);
                    decrementDistanceBy(10);
                }
                break;
            case SIMON_SAYS:
                // 1. Create simon says color sequence
                // 2. TODO: Start simon says get ready
                // 3. TODO: Poll until countdown is finished
                // 4. TODO: Start color sequence
                // 5. Start simon says game
                // 6. Poll until simon says is completed (interrupt handler will determine when it's over and whether the offense won)
                // 7. TODO: Show results on Outcome screen 
                // 8. Move the ball by the result
                pauseTime();
                for (i = 0; i < 10; i++)
                {
                    if (r2() < 0.25)
                    {
                        simon_says_seq[i] = BLUE;
                    }
                    else if (r2() < 0.5)
                    {
                        simon_says_seq[i] = ORANGE;
                    }
                    else if (r2() < 0.75)
                    {
                        simon_says_seq[i] = GREEN;
                    }
                    else
                    {
                        simon_says_seq[i] = RED;
                    }
                }
                
                // TODO: Switch to get ready screen
                delayTimer(5);

                curr_player_seq = 0;
                simon_says_happening = true;

                while (simon_says_happening)
                {
                    PCM_gotoLPM0();
                }

                startTime();
                // Offense played
                if (player1_offense && simon_says_player_won)
                {
                    scoredTouchdown = moveFootballForwardBy(20);
                    decrementDistanceBy(20);
                }
                else if (!player1_offense && simon_says_player_won)
                {
                    scoredTouchdown = moveFootballForwardBy(-20);
                    decrementDistanceBy(20);
                }

                break;
            case ROCK_PAPER_SCISSORS:
                // 1. TODO: Show Rock Paper and Scissors game placeholder
                // 2. Poll until both players choose their move
                // 3. TODO: Show results on Outcome screen
                // 4. Move the ball by the result
                pauseTime();
                player1_locked = false;
                player2_locked = false;

                /* Going to LPM3 */
                while (!player1_locked || !player2_locked)
                {
                    PCM_gotoLPM0();
                }
                startTime();

