kmui2/453-MSP432/main.c
                for (i = 0; i < 9; i++)
                {
                    if (rps_combos[i].player1 == player1_move && rps_combos[i].player2 == player2_move)
                    {
                        if (player1_offense && rps_combos[i].player1_wins)
                        {
                            scoredTouchdown = moveFootballForwardBy(10);
                            decrementDistanceBy(10);
                        }
                        // Player 2 uses Player 1's results in the array
                    }
                    else if (rps_combos[i].player2 == player1_move && rps_combos[i].player1 == player2_move)
                    {
                        if (!player1_offense && rps_combos[i].player1_wins)
                        {
                            scoredTouchdown = moveFootballForwardBy(-10);
                            decrementDistanceBy(10);
                        }
                    }
                }
                break;
            case TRIVIA:
                // 1. Show trivia screen with question
                // 2. Poll for both responses
                // 3. Show trivia answer
                // 4. TODO: Show results on Outcome screen
                // 4. Move the ball by the result
                pauseTime();

                sprintf(message, "TRIVIA -q \"%s\" \"%s\" \"%s\" \"%s\" \"%s\"",
                        trivia_questions[curr_trivia_question].question,
                        trivia_questions[curr_trivia_question].choice1,
                        trivia_questions[curr_trivia_question].choice2,
                        trivia_questions[curr_trivia_question].choice3,
                        trivia_questions[curr_trivia_question].choice4);
                sendCmd(message);
                // Defense Answers
                if (player1_offense)
                {
                    player2_locked = false;
                    while (!player2_locked)
                    {
                        PCM_gotoLPM0();
                    }
                    trivia_choice = player2_move;
                }
                else
                {
                    player1_locked = false;
                    while (!player1_locked)
                    {
                        PCM_gotoLPM0();
                    }
                    trivia_choice = player1_move;
                }
                
                // Send question with the answer
                sprintf(message, "TRIVIA -q \"%s\" \"%s\" \"%s\" \"%s\" \"%s\" \"%d\"",
                        trivia_questions[curr_trivia_question].question,
                        trivia_questions[curr_trivia_question].choice1,
                        trivia_questions[curr_trivia_question].choice2,
                        trivia_questions[curr_trivia_question].choice3,
                        trivia_questions[curr_trivia_question].choice4,
                        trivia_questions[curr_trivia_question].answer);
                sendCmd(message);

                startTime();
                if (trivia_choice != trivia_questions[curr_trivia_question].answer) {
                    if (player1_offense) {
                        scoredTouchdown = moveFootballForwardBy(10);
                        decrementDistanceBy(10);
                    } else {
                        scoredTouchdown = moveFootballForwardBy(-10);
                        decrementDistanceBy(10);
                    }
                }
                delayTimer(3);

                curr_trivia_question++;
                break;
            default:
                // printDebug("INVALID NEGATIVE OUTCOME: %d\n", outcome_res);
                break;
            }
        }

        if (scoredTouchdown) {
            sendCmd("OUTCOME -h \"TOUCHDOWN\"");
            if (player1_offense) {
                incrementPlayer1ScoreBy(7);
                moveFootballToYardage(75);
            } else {
                incrementPlayer2ScoreBy(7);
                moveFootballToYardage(25);
            }
            player1_offense = !player1_offense;
            resetTimeAndDown(player1_offense);
            delayTimer(3);
        } else {
            // TODO: update down and distance
            if (getDistance() <= 0) {
                resetTimeAndDown(player1_offense);
            } else {
                incrementDown();
            }
        }

        // Still set to fourth down after play
        if (getDown() == 4)
        {
            player1_offense = !player1_offense;
            resetTimeAndDown(player1_offense);
        }
    }

    // TODO: Game over
    while (1)
    {
        PCM_gotoLPM0();
    }
}

// Pi's receive interrupt handler
void EUSCIA0_IRQHandler(void)
{
    uint32_t status = UART_getEnabledInterruptStatus(EUSCI_A0_BASE);

    UART_clearInterruptFlag(EUSCI_A0_BASE, status);

    if (status & EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG)
    {
        if (!ttt_game_completed)
        {
            int8_t data = reverse(UART_receiveData(EUSCI_A0_BASE));
            ttt_player1_won = data == 0;
            ttt_game_completed = true;
        }
    }
}

// Controller 1's receive interrupt handler
void EUSCIA1_IRQHandler(void)
{
    char message[100];
    uint32_t status = UART_getEnabledInterruptStatus(EUSCI_A1_BASE);

    UART_clearInterruptFlag(EUSCI_A1_BASE, status);

    if (status & EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG)
    {
        int8_t data = reverse(UART_receiveData(EUSCI_A1_BASE));

        if (!player1_locked || (player1_offense && simon_says_happening))
        {
            player1_move = data;
            player1_locked = true;

            if (simon_says_happening)
            {
                if (simon_says_seq[curr_player_seq] != player1_move)
                {
                    simon_says_player_won = false;
                    simon_says_happening = false;
                }
                else
                {
                    curr_player_seq++;
                }
            }
            if (simon_says_happening && curr_player_seq == 10)
            {
                simon_says_player_won = true;
                simon_says_happening = false;
            }
        }
        // sprintf(message, "detection_status=%d\n", data);
        // printDebug(message);
    }
}

// Controller 2's receive interrupt handler
void EUSCIA2_IRQHandler(void)
{
    char message[100];
    uint32_t status = UART_getEnabledInterruptStatus(EUSCI_A2_BASE);

    UART_clearInterruptFlag(EUSCI_A2_BASE, status);

    if (status & EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG)
    {
        int8_t data = reverse(UART_receiveData(EUSCI_A2_BASE));

        if (!player2_locked || (!player1_offense && simon_says_happening))
        {
            player2_move = data;
            player2_locked = true;

            if (simon_says_happening)
            {
                if (simon_says_seq[curr_player_seq] != player1_move)
                {
                    simon_says_player_won = false;
                    simon_says_happening = false;
                }
                else
                {
                    curr_player_seq++;
                }
            }
            if (simon_says_happening && curr_player_seq == 10)
            {
                simon_says_player_won = true;
                simon_says_happening = false;
            }
        }
        sprintf(message, "detection_status=%d\n", data);
        printDebug(message);
    }
}

/* GPIO ISR */
void PORT1_IRQHandler(void)
{
    uint32_t status;

    status = GPIO_getEnabledInterruptStatus(GPIO_PORT_P1);
    GPIO_clearInterruptFlag(GPIO_PORT_P1, status);

    /* Toggling the output on the LED */
    if (status & GPIO_PIN1)
    {
        GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0);
    }

    if (status & GPIO_PIN4)
    {
        GPIO_toggleOutputOnPin(GPIO_PORT_P2, GPIO_PIN0);
    }
}
